<?php
// Домашняя работа №3

/* 1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка. */

$a = 0;
while ($a < 100) {
    if ($a % 3 === 0) {
        echo($a . PHP_EOL);
    }
    $a += 1;
}

echo '<hr>';

/* 2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:

0 – ноль.
1 – нечетное число.
2 – четное число.
3 – нечетное число.
…
10 – четное число.
*/
$b = 0;
do {
    if ($b === 0) {
        echo ($b . ' - ноль ' . '<br>');
    } else if ($b%2 === 0) {
        echo ($b . ' - четное число ' . '<br>');
    } else {
        echo ($b . ' - нечетное число ' . '<br>');
    }
   $b += 1;
} while ($b <= 10);

echo '<hr>';


/* 3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений –
массивы с названиями городов из соответствующей области.
Вывести в цикле значения массива, чтобы результат был таким:

    Московская область:
    Москва, Зеленоград, Клин
    Ленинградская область:
    Санкт-Петербург, Всеволожск, Павловск, Кронштадт
    Рязанская область … (названия городов можно найти на maps.yandex.ru)
 */

$areaArr = [
        'Московская область:' => [
            'Москва',
            'Зеленоград',
            'Клин'
        ],
        'Ленинградская область:' => [
            'Санкт-Петербург',
            'Всеволожск',
            'Павловск',
            'Кронштадт'
        ],
        'Рязанская область:' => [
            'Рязань',
            'Скопин',
            'Ряжск'
        ],

];

foreach ($areaArr as $regions => $city)
{
    echo $regions , '<br>    ', implode(', ', $city), '<br>';
}

echo '<hr>';

/* 4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские
буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).

Написать функцию транслитерации строк. */



function translit($txt) {
    $translitArr = ['а' => "a", 'б' => "b", 'в' => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "yo", "ж" => "zh", "з" => "z",
        "и" => "i", "й" => "i", "к" => "k", "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r", "с" => "s", "т" => "t",
        "у" => "u", "ф" => "f", "х" => "h", "ц" => "ts", "ч" => "ch", "ш" => "sh", "щ" => "csh", "ь" => "", "ы" => "y", "ъ" => "",
        "э" => "e", "ю" => "yu", "я" => "ya", " " => " ", "," => ","];

    $text = '';

    for ($i = 0; $i <= mb_strlen($txt) - 1; $i++) {
        $text.= $translitArr[mb_substr($txt,$i,1)];
    }

    return $text;
}

echo (translit('привет, мир'));

echo '<hr>';


/* 5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку. */

function nospace($txt) {
    for ($i = 0; $i <= mb_strlen($txt) - 1; $i++ ) {
        if (mb_substr($txt,$i,1) == " ") {
            $newtext.= "_";
        }
        else {
            $newtext.= mb_substr($txt,$i,1);
        }
    }
    return $newtext;
}

echo (nospace('привет, мир'));

echo '<hr>';


/* 6. В имеющемся шаблоне сайта заменить статичное меню (ul – li) на генерируемое через PHP.
Необходимо представить пункты меню как элементы массива и вывести их циклом. Подумать, как можно реализовать меню
с вложенными подменю? Попробовать его реализовать. */

$menu = [
    'Title' => [
        'submenu1',
        'submenu2',
        'submenu3',
    ],
    'Title2' => [
        'submenu21',
        'submenu22',
        'submenu23',
    ],
];

function menuRender($menu) {
    foreach ($menu as $title => $submenu) {
        echo '<ul><li>' . $title;
        foreach ($submenu as $subsubmenu) {
            echo '<li>' . $subsubmenu . '</li>';
        }
        echo '</li></ul>';
    }
}

menuRender($menu);

echo '<hr>';

/* 7. *Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла. Выглядеть должно так:

for (…){ // здесь пусто} */

for ($i = 0; $i < 10; print $i++) {}


echo '<hr>';


/* 8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К». */

foreach ($areaArr as $regions => $cities) {
    echo "<br>".$regions." ";
    foreach ($cities as $city) {
        if (mb_substr($city,0,1) == "К") {
            echo $city." ";
        }
    }
}

echo '<hr>';


/* 9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке,
производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается
при конструировании url-адресов на основе названия статьи в блогах). */

function urlConstructor($txt) {
    $translitArr = ['а' => "a", 'б' => "b", 'в' => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "yo", "ж" => "zh", "з" => "z",
        "и" => "i", "й" => "i", "к" => "k", "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r", "с" => "s", "т" => "t",
        "у" => "u", "ф" => "f", "х" => "h", "ц" => "ts", "ч" => "ch", "ш" => "sh", "щ" => "csh", "ь" => "", "ы" => "y", "ъ" => "",
        "э" => "e", "ю" => "yu", "я" => "ya", " " => " ", "," => ",", "_" => "_"];

    $text = '';

    for ($i = 0; $i <= mb_strlen($txt) - 1; $i++) {
        if (mb_substr($txt,$i,1) == " ") {
            $text.= "_";
        }
        else {
            $text.= $translitArr[mb_substr($txt,$i,1)];
        }

    }

    return $text;
}

echo urlConstructor('домашня работа номер три');

echo '<hr>';

?>


<!doctype html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Homework3</title>
</head>
<body>

</body>
</html>